Revit 2024 API
PanelScheduleTemplate.IsSwitchboardSchedule Property
 Checks to see if this object is switchboard schedule template element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsSwitchboardSchedule { get; }
Visual Basic
Public ReadOnly Property IsSwitchboardSchedule As Boolean
	Get
Visual C++
public:
property bool IsSwitchboardSchedule {
	bool get ();
}
See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace